{
  "speaking_engagements": [
    {
      "id": "graphql-summit-2023",
      "title": "Scaling GraphQL Federation in the Enterprise",
      "event": "GraphQL Summit",
      "date": "2023-10-15T14:00:00Z",
      "location": "San Francisco, CA",
      "type": "Conference",
      "video_url": "https://youtube.com/placeholder",
      "slides_url": "https://slides.com/placeholder",
      "description": "Presented strategies for implementing and scaling GraphQL Federation across large enterprise organizations. Covered architectural patterns, governance models, developer enablement, and lessons learned from deploying federation at Fidelity Investments. The talk included real-world examples of challenges faced and solutions implemented to achieve enterprise-wide GraphQL adoption.",
      "topics": ["GraphQL Federation", "Enterprise Architecture", "Developer Enablement", "API Design"],
      "audience_size": 500,
      "key_takeaways": [
        "Federation requires both technical infrastructure and organizational support",
        "Developer education is critical for successful adoption",
        "Start with pilot teams and expand incrementally",
        "Governance should enable, not restrict, innovation"
      ]
    },
    {
      "id": "graphql-summit-2024",
      "title": "Building Developer Communities Around GraphQL",
      "event": "GraphQL Summit",
      "date": "2024-09-20T10:30:00Z",
      "location": "San Diego, CA",
      "type": "Conference",
      "video_url": "https://youtube.com/placeholder",
      "slides_url": "https://slides.com/placeholder",
      "description": "Shared insights on creating and nurturing internal developer communities to accelerate GraphQL adoption. Discussed the creation of the GraphQL Certification Program, organizing internal conferences, and building sustainable community engagement models. Highlighted metrics showing how community investment directly correlates with technology adoption rates.",
      "topics": ["Developer Community", "GraphQL", "Education", "Culture"],
      "audience_size": 600,
      "key_takeaways": [
        "Certification programs provide motivation and validate skills",
        "Regular events maintain momentum and engagement",
        "Community office hours address adoption barriers quickly",
        "Measure community health through engagement metrics, not just adoption numbers"
      ]
    },
    {
      "id": "geekgirls-2023",
      "title": "From Developer to Director: Navigating a Career in Architecture",
      "event": "GeekGirls Virtual Event",
      "date": "2023-06-12T15:00:00Z",
      "location": "Virtual",
      "type": "Webinar",
      "video_url": "https://youtube.com/placeholder",
      "slides_url": "https://slides.com/placeholder",
      "description": "Shared personal career journey from freelance web developer to Director of Architecture at a Fortune 500 company. Discussed navigating career transitions, building technical leadership skills, overcoming challenges as a woman in technology, and strategies for continuous learning and growth. Emphasized the importance of mentorship, community, and staying technically hands-on as you advance in leadership.",
      "topics": ["Career Development", "Technical Leadership", "Women in Tech", "Mentorship"],
      "audience_size": 300,
      "key_takeaways": [
        "Technical depth enables better architectural decisions",
        "Leadership is about enabling others, not just making decisions",
        "Continuous learning is essential at every career stage",
        "Advocate for yourself and others"
      ]
    },
    {
      "id": "graphql-scale-2024",
      "title": "GraphQL at Scale: Performance and Optimization Strategies",
      "event": "GraphQL at Scale Conference",
      "date": "2024-04-08T13:00:00Z",
      "location": "Virtual",
      "type": "Conference",
      "video_url": "https://youtube.com/placeholder",
      "slides_url": "https://slides.com/placeholder",
      "description": "Deep technical dive into performance optimization strategies for GraphQL at enterprise scale. Covered query optimization, caching strategies, monitoring and observability, and handling high-traffic scenarios. Shared specific techniques used at Fidelity to maintain sub-200ms response times while handling millions of requests daily.",
      "topics": ["GraphQL Performance", "Optimization", "Caching", "Observability"],
      "audience_size": 400,
      "key_takeaways": [
        "DataLoader is essential for preventing N+1 query problems",
        "Implement query complexity analysis to prevent abuse",
        "Caching strategy should consider both edge and origin caching",
        "Monitor query patterns to identify optimization opportunities"
      ]
    },
    {
      "id": "graphql-day-internal-2022",
      "title": "Launching GraphQL Day - Internal Conference",
      "event": "Fidelity Internal GraphQL Day",
      "date": "2022-11-10T09:00:00Z",
      "location": "Boston, MA (Internal Event)",
      "type": "Internal",
      "video_url": null,
      "slides_url": null,
      "description": "Organized and keynoted the inaugural internal GraphQL Day Conference at Fidelity Investments. The event featured talks from internal teams, workshops, and networking opportunities. Attendance exceeded expectations with 200+ developers participating. The conference established GraphQL as a strategic technology choice and created lasting community connections.",
      "topics": ["GraphQL", "Community Building", "Conference Organization", "Internal Advocacy"],
      "audience_size": 200,
      "key_takeaways": [
        "Internal conferences accelerate technology adoption",
        "Showcasing internal success stories builds confidence",
        "Hands-on workshops are more valuable than presentations alone",
        "Community connections formed at events drive ongoing collaboration"
      ]
    },
    {
      "id": "graphql-day-internal-2023",
      "title": "GraphQL Day 2023: Advanced Patterns and Best Practices",
      "event": "Fidelity Internal GraphQL Day",
      "date": "2023-11-15T09:00:00Z",
      "location": "Boston, MA (Internal Event)",
      "type": "Internal",
      "video_url": null,
      "slides_url": null,
      "description": "Keynoted the second annual GraphQL Day Conference, focusing on advanced patterns and sharing lessons learned from a year of expanded GraphQL usage. Presented case studies from teams that had adopted GraphQL, discussed evolving best practices, and facilitated discussions on the future direction of GraphQL at Fidelity.",
      "topics": ["GraphQL", "Advanced Patterns", "Case Studies", "Best Practices"],
      "audience_size": 250,
      "key_takeaways": [
        "Year-over-year growth demonstrated successful adoption strategy",
        "Advanced patterns enable more sophisticated use cases",
        "Continuous evolution of standards keeps pace with technology changes",
        "Community-driven standards gain better adoption than top-down mandates"
      ]
    }
  ]
}