{
  "speaking_engagements": [
    {
      "id": "graphql-summit-2024",
      "title": "A Request For Comment: Federating standards and schema design patterns at Fidelity",
      "event": "GraphQL Summit",
      "date": "2024-09-20T10:30:00Z",
      "location": "New York, NY",
      "type": "Conference",
      "video_url": "https://youtu.be/vnFyZK0N8CI?si=k2IetEJXelYg3S75",
      "slides_url": "https://www.apollographql.com/events/a-request-for-comment-federating-standards-and-schema-design-patterns-at-fidelity",
      "description": "Creating GraphQL schemas at Enterprise scale involves science, art, and compromise. Striking the right balance between usability, schema evolution, and existing implementation is essential. Join this talk to learn how Fidelity uses RFCs to democratize the decision-making process in GraphQL standards and schema design. Discover specific patterns we use in our supergraph, developed as a result of this collaborative process.",
      "topics": ["Developer Community", "GraphQL", "Education", "RFC"],
      "audience_size": 600,
      "key_takeaways": [
        "Establishing a collaborative RFC process empowers engineers",
        "Bulding scalable solutions requires balancing multiple perspectives",
        "Community engagement drives better adoption of standards",
        "Solve complex problems as a community, not in isolation"
      ]
    },
    {
      "id": "graphql-day-internal-2023",
      "title": "GraphQL Day - Internal Conference",
      "event": "GraphQL Day - Fidelity Internal",
      "date": "2022-11-10T09:00:00Z",
      "location": "Raleigh, NC (Internal Event)",
      "type": "Internal",
      "video_url": null,
      "slides_url": null,
      "description": "Organized internal GraphQL Day Conference at Fidelity Investments. The event featured talks from internal teams, workshops, and networking opportunities. Attendance exceeded expectations with 600+ developers participating. The conference established GraphQL as a strategic technology choice and created lasting community connections.",
      "topics": ["GraphQL", "Community Building", "Conference Organization", "Internal Advocacy"],
      "audience_size": 600,
      "key_takeaways": [
        "Internal conferences accelerate technology adoption",
        "Showcasing internal success stories builds confidence",
        "Hands-on workshops are more valuable than presentations alone",
        "Community connections formed at events drive ongoing collaboration"
      ]
    },
    {
      "id": "graphql-summit-2022",
      "title": "Scaling GraphQL Federation in the Enterprise At Fidelity Investments",
      "event": "GraphQL Summit",
      "date": "2022-10-15T14:00:00Z",
      "location": "San Diego, CA",
      "type": "Conference",
      "video_url": "https://www.apollographql.com/events/determining-the-right-architecture-design-when-adopting-apollo-federation",
      "slides_url": "https://www.apollographql.com/events/determining-the-right-architecture-design-when-adopting-apollo-federation",
      "description": "As teams think about creating or migrating their APIs to Apollo Federation, it can be perplexing, if not paralyzing, to decide where functionality should go in a distributed system. In this session, Fidelity Investments share the techniques that have helped them identify and separate functionality, using time-tested engineering techniques, including domain-driven design, that teams can embrace to become productive faster.",
      "topics": ["GraphQL Federation", "Enterprise Architecture", "Developer Enablement", "API Design"],
      "audience_size": 500,
      "key_takeaways": [
        "Techniques to help teams identify and separate functionality using engineering best practices.",
        "Domain-Driven Design (DDD) approaches to shape subgraphs in a federated architecture.",
        "Strategies for team productivity and scaling when working with Federation at enterprise scale",
        "Practical lessons from Fidelity Investments’ experience implementing Federation in real projects."
      ]
    },
    {
      "id": "graphql-scale-2022",
      "title": "Determining the right architecture design when adopting Apollo Federation",
      "event": "GraphQL Scale 2022",
      "date": "2022-11-15T12:00:00Z",
      "location": "Virtual",
      "type": "Conference",
      "video_url": "https://youtu.be/Nl0ItTTP_jE?si=YiZZvW_5HWAba43W",
      "slides_url": "",
      "description": "As GraphQL adoption grows within an enterprise, choosing the right architecture to support scalability, team autonomy, and performance becomes critical. This talk explores various architecture patterns for implementing Apollo Federation in large organizations. It covers considerations such as service boundaries, schema design, deployment strategies, and operational challenges.",
      "topics": ["GraphQL Performance", "Optimization", "Caching", "Observability"],
      "audience_size": 400,
      "key_takeaways": [
        "Mature GrapgQL adoption requires thoughtful architecture",
        "Leverage Business Architecture Framework to breach the gap between business and technical domains",
        "Utilize Domain-Driven Design to ensure separations of concerns",
        "Identified parallels between DDD and GraphQL federation concepts"
      ]
    },
    {
      "id": "geekgirls-2022",
      "title": "AWS, GraphQL with Apollo-VueJS: Simple Technologies that Help Deliver Enterprise-Grade Applications",
      "event": "GeekGirls Virtual Event",
      "date": "2022-06-12T15:00:00Z",
      "location": "Virtual",
      "type": "Webinar",
      "video_url": "https://youtu.be/WGf2BRZTxv4?si=IK9h6_2auOIj7kMK",
      "slides_url": "https://girlgeek.io/conferences/elevate2022/",
      "description": "GraphQL allows consumers to get exactly what they need, with a significant performance boost. In this session, Maria Lucena and Divya Mahajan will cover some GraphQL fundamentals and AppSync, AWS’s implementation of GraphQL. Next, we’ll explore a Vue.js SPA that leverages the Apollo-Client to connect to AppSync with Cognito. Finally, we will examine how a mixture of AWS services, including S3, Route53, CloudFront, can be leveraged to serve the application safely and reliably.",
      "topics": ["Career Development", "Technical Leadership", "Women in Tech", "Mentorship"],
      "audience_size": 300,
      "key_takeaways": [
        "Using GraphQL lets clients request only the data they need, reducing over-fetching and improving app performance",
        "Architectural choices for building scalable enterprise applications with AWS services.",
        "Apollo Client simplifies data management between Vue.js UIs and GraphQL APIs.",
        "Advocate for yourself and others",
        "Maintaining performance and consistency when developing enterprise-grade applications using modern stacks"
      ]
    }
  ]
}